solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_USBNC.h
#define USBNC_EUSB_CTRL0_PONRST_MASK             (0x40U)
#define USBNC_EUSB_CTRL0_PONRST_SHIFT            (6U)
/*! PONRST - Power-On Reset
 *  0b0..Reset
 *  0b1..Operate normally
 */
#define USBNC_EUSB_CTRL0_PONRST(x)               (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_CTRL0_PONRST_SHIFT)) & USBNC_EUSB_CTRL0_PONRST_MASK)

#define USBNC_EUSB_CTRL0_NATIVE_MODE_MASK        (0x80U)
#define USBNC_EUSB_CTRL0_NATIVE_MODE_SHIFT       (7U)
/*! NATIVE_MODE - Mode Select
 *  0b0..Repeater mode
 *  0b1..Native mode
 */
#define USBNC_EUSB_CTRL0_NATIVE_MODE(x)          (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_CTRL0_NATIVE_MODE_SHIFT)) & USBNC_EUSB_CTRL0_NATIVE_MODE_MASK)

#define USBNC_EUSB_CTRL0_EUSB_DEV_PORT_RST_MASK  (0x1000000U)
#define USBNC_EUSB_CTRL0_EUSB_DEV_PORT_RST_SHIFT (24U)
/*! EUSB_DEV_PORT_RST - Trigger Device Issue Port Reset
 *  0b0..No action
 *  0b1..Trigger device issue port reset
 */
#define USBNC_EUSB_CTRL0_EUSB_DEV_PORT_RST(x)    (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_CTRL0_EUSB_DEV_PORT_RST_SHIFT)) & USBNC_EUSB_CTRL0_EUSB_DEV_PORT_RST_MASK)
/*! @} */

/*! @name EUSB_CTRL1 - eUSB Control 1 */
/*! @{ */

#define USBNC_EUSB_CTRL1_EUSB_SQ_MASK            (0xE000U)
#define USBNC_EUSB_CTRL1_EUSB_SQ_SHIFT           (13U)
/*! EUSB_SQ - eUSB Squelch
 *  0b000..66.6mV
 *  0b001..63.2mV
 *  0b010..59.7mV
 *  0b011..56mV
 *  0b100..80.6mV
 *  0b101..76.9mV
 *  0b110..73.5mV
 *  0b111..70mV
 */
#define USBNC_EUSB_CTRL1_EUSB_SQ(x)              (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_CTRL1_EUSB_SQ_SHIFT)) & USBNC_EUSB_CTRL1_EUSB_SQ_MASK)

#define USBNC_EUSB_CTRL1_EUSB_FSTX_OPT_MASK      (0x180000U)
#define USBNC_EUSB_CTRL1_EUSB_FSTX_OPT_SHIFT     (19U)
/*! EUSB_FSTX_OPT - eUSB Full-Speed TX Option
 *  0b00..Default
 *  0b01..Faster 10%
 *  0b10..Slower 20%
 *  0b11..Slower 10%
 */
#define USBNC_EUSB_CTRL1_EUSB_FSTX_OPT(x)        (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_CTRL1_EUSB_FSTX_OPT_SHIFT)) & USBNC_EUSB_CTRL1_EUSB_FSTX_OPT_MASK)
/*! @} */

/*! @name EUSB_RAP - eUSB RAP Control and Status */
/*! @{ */

#define USBNC_EUSB_RAP_CM_RAP_WRDATA_MASK        (0xFFU)
#define USBNC_EUSB_RAP_CM_RAP_WRDATA_SHIFT       (0U)
/*! CM_RAP_WRDATA - CM.RAP Write Data */
#define USBNC_EUSB_RAP_CM_RAP_WRDATA(x)          (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_WRDATA_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_WRDATA_MASK)

#define USBNC_EUSB_RAP_CM_RAP_ADDR_MASK          (0x3F00U)
#define USBNC_EUSB_RAP_CM_RAP_ADDR_SHIFT         (8U)
/*! CM_RAP_ADDR - CM.RAP Address */
#define USBNC_EUSB_RAP_CM_RAP_ADDR(x)            (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_ADDR_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_ADDR_MASK)

#define USBNC_EUSB_RAP_CM_RAP_OP_MASK            (0xC000U)
#define USBNC_EUSB_RAP_CM_RAP_OP_SHIFT           (14U)
/*! CM_RAP_OP - CM.RAP Operation Code
 *  0b00..Write; data is written to the register address
 *  0b01..Read; data is read from the register address
 *  0b10..Clear; active-high, bitwise clear with the data on the register address
 *  0b11..Set; bitwise OR with the data on the register address
 */
#define USBNC_EUSB_RAP_CM_RAP_OP(x)              (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_OP_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_OP_MASK)

#define USBNC_EUSB_RAP_CM_RAP_INIT_EN_MASK       (0x10000U)
#define USBNC_EUSB_RAP_CM_RAP_INIT_EN_SHIFT      (16U)
/*! CM_RAP_INIT_EN - Enable CM.RAP Feature
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBNC_EUSB_RAP_CM_RAP_INIT_EN(x)         (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_INIT_EN_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_INIT_EN_MASK)

#define USBNC_EUSB_RAP_CM_RAP_START_MASK         (0x20000U)
#define USBNC_EUSB_RAP_CM_RAP_START_SHIFT        (17U)
/*! CM_RAP_START - CM.RAP Start
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBNC_EUSB_RAP_CM_RAP_START(x)           (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_START_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_START_MASK)

#define USBNC_EUSB_RAP_CM_RAP_FAIL_MASK          (0x200000U)
#define USBNC_EUSB_RAP_CM_RAP_FAIL_SHIFT         (21U)
/*! CM_RAP_FAIL - CM.RAP Command Fail
 *  0b0..Not failed
 *  0b1..Failed
 */
#define USBNC_EUSB_RAP_CM_RAP_FAIL(x)            (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_FAIL_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_FAIL_MASK)

#define USBNC_EUSB_RAP_CM_RAP_DONE_MASK          (0x400000U)
#define USBNC_EUSB_RAP_CM_RAP_DONE_SHIFT         (22U)
/*! CM_RAP_DONE - CM.RAP Command Done
 *  0b0..Not complete
 *  0b1..Complete
 */
#define USBNC_EUSB_RAP_CM_RAP_DONE(x)            (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_DONE_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_DONE_MASK)

#define USBNC_EUSB_RAP_CM_RAP_INIT_READY_MASK    (0x800000U)
#define USBNC_EUSB_RAP_CM_RAP_INIT_READY_SHIFT   (23U)
/*! CM_RAP_INIT_READY - Host and Device Entering CM.RAP State
 *  0b0..Not ready
 *  0b1..Ready
 */
#define USBNC_EUSB_RAP_CM_RAP_INIT_READY(x)      (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_INIT_READY_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_INIT_READY_MASK)

#define USBNC_EUSB_RAP_CM_RAP_RDDATA_MASK        (0xFF000000U)
#define USBNC_EUSB_RAP_CM_RAP_RDDATA_SHIFT       (24U)
/*! CM_RAP_RDDATA - CM.RAP Read Data */
#define USBNC_EUSB_RAP_CM_RAP_RDDATA(x)          (((uint32_t)(((uint32_t)(x)) << USBNC_EUSB_RAP_CM_RAP_RDDATA_SHIFT)) & USBNC_EUSB_RAP_CM_RAP_RDDATA_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group USBNC_Register_Masks */


/*!
 * @}
 */ /* end of group USBNC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* USBNC_H_ */

